{"modelTopology": {"training_config": {"metrics": ["mean_absolute_error"], "loss": "mean_squared_error", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.1.2", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "batch_input_shape": [null, 437], "use_bias": true, "activation": "linear"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 250, "use_bias": true, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "use_bias": true, "activity_regularizer": null, "name": "dense_3"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "use_bias": true, "activity_regularizer": null, "name": "dense_4"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "noise_shape": null, "seed": null, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 5, "use_bias": true, "activity_regularizer": null, "name": "dense_5"}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null, "name": "dense_6"}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [100], "name": "batch_normalization_1/gamma"}, {"dtype": "float32", "shape": [100], "name": "batch_normalization_1/beta"}, {"dtype": "float32", "shape": [100], "name": "batch_normalization_1/moving_mean"}, {"dtype": "float32", "shape": [100], "name": "batch_normalization_1/moving_variance"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [250], "name": "batch_normalization_2/gamma"}, {"dtype": "float32", "shape": [250], "name": "batch_normalization_2/beta"}, {"dtype": "float32", "shape": [250], "name": "batch_normalization_2/moving_mean"}, {"dtype": "float32", "shape": [250], "name": "batch_normalization_2/moving_variance"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [500], "name": "batch_normalization_3/gamma"}, {"dtype": "float32", "shape": [500], "name": "batch_normalization_3/beta"}, {"dtype": "float32", "shape": [500], "name": "batch_normalization_3/moving_mean"}, {"dtype": "float32", "shape": [500], "name": "batch_normalization_3/moving_variance"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [50], "name": "batch_normalization_4/gamma"}, {"dtype": "float32", "shape": [50], "name": "batch_normalization_4/beta"}, {"dtype": "float32", "shape": [50], "name": "batch_normalization_4/moving_mean"}, {"dtype": "float32", "shape": [50], "name": "batch_normalization_4/moving_variance"}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "shape": [5], "name": "batch_normalization_5/gamma"}, {"dtype": "float32", "shape": [5], "name": "batch_normalization_5/beta"}, {"dtype": "float32", "shape": [5], "name": "batch_normalization_5/moving_mean"}, {"dtype": "float32", "shape": [5], "name": "batch_normalization_5/moving_variance"}]}, {"paths": ["group6-shard1of1"], "weights": [{"dtype": "float32", "shape": [437, 100], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_1/bias"}]}, {"paths": ["group7-shard1of1"], "weights": [{"dtype": "float32", "shape": [100, 250], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [250], "name": "dense_2/bias"}]}, {"paths": ["group8-shard1of1"], "weights": [{"dtype": "float32", "shape": [250, 500], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [500], "name": "dense_3/bias"}]}, {"paths": ["group9-shard1of1"], "weights": [{"dtype": "float32", "shape": [500, 50], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [50], "name": "dense_4/bias"}]}, {"paths": ["group10-shard1of1"], "weights": [{"dtype": "float32", "shape": [50, 5], "name": "dense_5/kernel"}, {"dtype": "float32", "shape": [5], "name": "dense_5/bias"}]}, {"paths": ["group11-shard1of1"], "weights": [{"dtype": "float32", "shape": [5, 1], "name": "dense_6/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_6/bias"}]}]}